Revit 2024 API
RebarFreeFormAccessor.HasValidServer Method
 Returns true if the current rebar contains a valid server GUID, false otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool HasValidServer()
Visual Basic
Public Function HasValidServer As Boolean
Visual C++
public:
bool HasValidServer()
Return Value
 Returns true if the current rebar contains a valid server GUID, false otherwise.
See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace